---
kind: property
id: P:Autodesk.Revit.DB.SolidOptions.ExtraFaceAndEdgeHistoryKey
source: html/526b3896-2466-e966-e017-5fbfcc63ecd8.htm
---
# Autodesk.Revit.DB.SolidOptions.ExtraFaceAndEdgeHistoryKey Property

Optional extra key used to create face and edge histories for the Solid.
 If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.

## Syntax (C#)
```csharp
public int ExtraFaceAndEdgeHistoryKey { get; set; }
```